app/Models/CrudModel.php

        public function insertar($datos) {
            $Nombres = $this->db->table('personas');

            // Inserción asociativo
            $Nombres->insert($datos);
---
INSERT INTO `personas` (`doc_cantante`, `nombre_completo`, `nombre_artistico`, `fecha_nacimiento`, `pais_vive`, `ciudad_vive`) VALUES ('1234567890', 'aaaaaaaaaaaaaaaaaaaaaaaaa', 'sdfdsfsdf324234324', '2022-03-29', 'Colombia', 'Bogotá')

        public function eliminar($idNombre) {
            // Creamos conexión a la tabla
            $Nombres = $this->db->table('personas');

            // Rastreamos los datos asociados al cliente
            $Nombres->where('id_cant', $idNombre);

            // Retornamos actualización
            return $Nombres->delete();
---
DELETE FROM `personas`
WHERE `id_cant` = '1'